def split(word):
    return [char for char in word]

def ConTranslate_EN_TH(Text):
    List = []
    int_List = []
    New_List = []

    Bucket_EN = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '='
                ,'!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '+'
                ,'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', '\\'
                ,'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}', '|'
                ,'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', "'"
                ,'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"'
                ,'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/'
                ,'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?',' ']

    Bucket_TH = ['ๅ', '/', '-', 'ภ', 'ถ', 'ุ', 'ึ', 'ค', 'ต', 'จ', 'ข', 'ช'
                ,'+', '๑', '๒', '๓', '๔', 'ู', '฿', '๕', '๖', '๗', '๘', '๙'
                ,'ๆ', 'ไ', 'ำ', 'พ', 'ะ', 'ั', 'ี', 'ร', 'น', 'ย', 'บ', 'ล', 'ฃ'
                ,'๐', '"', 'ฎ', 'ฑ', 'ธ', 'ํ', '๊', 'ณ', 'ฯ', 'ญ', 'ฐ', ',', 'ฅ'
                ,'ฟ', 'ห', 'ก', 'ด', 'เ', '้', '่', 'า', 'ส', 'ว', 'ง'
                ,'ฤ', 'ฆ', 'ฏ', 'โ', 'ฌ', '็', '๋', 'ษ', 'ศ', 'ซ', '.'
                ,'ผ', 'ป', 'แ', 'อ', 'ิ', 'ื', 'ท', 'ม', 'ใ', 'ฝ'
                ,'(', ')', 'ฉ', 'ฮ', 'ฺ', '์', '?', 'ฒ', 'ฬ', 'ฦ',' ']

    for x in range(len(Text)):
        List.append(Text[x])
    for y in range(len(List)):
        int_List.append(Bucket_EN.index(List[y]))
    for z in range(len(int_List)):
        New_List.append(Bucket_TH[(int_List[z])])
        
    print(''.join(New_List))

def ConTranslate_TH_EN(Text):
    List = []
    int_List = []
    New_List = []

    Bucket_EN = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '='
                ,'!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '+'
                ,'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', '\\'
                ,'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}', '|'
                ,'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', "'"
                ,'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"'
                ,'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/'
                ,'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?',' ']

    Bucket_TH = ['ๅ', '/', '-', 'ภ', 'ถ', 'ุ', 'ึ', 'ค', 'ต', 'จ', 'ข', 'ช'
                ,'+', '๑', '๒', '๓', '๔', 'ู', '฿', '๕', '๖', '๗', '๘', '๙'
                ,'ๆ', 'ไ', 'ำ', 'พ', 'ะ', 'ั', 'ี', 'ร', 'น', 'ย', 'บ', 'ล', 'ฃ'
                ,'๐', '"', 'ฎ', 'ฑ', 'ธ', 'ํ', '๊', 'ณ', 'ฯ', 'ญ', 'ฐ', ',', 'ฅ'
                ,'ฟ', 'ห', 'ก', 'ด', 'เ', '้', '่', 'า', 'ส', 'ว', 'ง'
                ,'ฤ', 'ฆ', 'ฏ', 'โ', 'ฌ', '็', '๋', 'ษ', 'ศ', 'ซ', '.'
                ,'ผ', 'ป', 'แ', 'อ', 'ิ', 'ื', 'ท', 'ม', 'ใ', 'ฝ'
                ,'(', ')', 'ฉ', 'ฮ', 'ฺ', '์', '?', 'ฒ', 'ฬ', 'ฦ',' ']

    for x in range(len(Text)):
        List.append(Text[x])
    for y in range(len(List)):
        int_List.append(Bucket_TH.index(List[y]))
    for z in range(len(int_List)):
        New_List.append(Bucket_EN[(int_List[z])])

    print(''.join(New_List))

Text = str(input("Enter Text : "))

ConTranslate_EN_TH(Text)

